<!-- dflook/terraform-github-actions {"workspace":"fallback-parse","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"b58367ec67a9aaac9d76ae7567aec3a04d58b5912e0a2f5f4c699f69016fa196","plan_job_ref":"Job Test actions using target and replace #455 at https://github.com/dflook/terraform-github-actions/actions/runs/12936786423","plan_hash":"189d0a7131d0ca795302c8abb1887be365d5bc174528a1d99f29edae0cc14f5c","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fallback-parse__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "hK4S5Z0hHv" -> (known after apply)
!~  foreach = "VNuH9wghNL" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #455](https://github.com/dflook/terraform-github-actions/actions/runs/12936786423)